# FlexDuctType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FlexDuct..::..FlexDuctType Property
FlexDuct Class See Also
---
The flex duct type of this flex duct.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FlexDuctType FlexDuctType { get; set; }
```

Visual Basic
---
```text
Public Property FlexDuctType As FlexDuctType
	Get
	Set
```

Visual C++
---
```text
public:
property FlexDuctType^ FlexDuctType {
	FlexDuctType^ get ();
	void set (FlexDuctType^ value);
}
```

# See Also
FlexDuct Class
Autodesk.Revit.DB.Mechanical Namespace